MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC1225FBD64-321/mcu.h
  __IO uint32_t CLKOUTCLKSEL;           /*!< Offset: 0x0E0 (R/W)  CLKOUT clock source select Register */
  __IO uint32_t CLKOUTUEN;              /*!< Offset: 0x0E4 (R/W)  CLKOUT clock source update enable Register */
  __IO uint32_t CLKOUTDIV;              /*!< Offset: 0x0E8 (R/W)  CLKOUT clock divider Register */
       uint32_t RESERVED10[5];

  __I  uint32_t PIOPORCAP0;             /*!< Offset: 0x100 (R/ )  POR captured PIO status 0 Register */
  __I  uint32_t PIOPORCAP1;             /*!< Offset: 0x104 (R/ )  POR captured PIO status 1 Register */
       uint32_t RESERVED11[11];
  __IO uint32_t IOCONFIGCLKDIV6;        /*!< Offset: 0x134 (R/W)  Peripheral clock 6 to the IOCONFIG block for prg. glitch filter Register */
  __IO uint32_t IOCONFIGCLKDIV5;        /*!< Offset: 0x138 (R/W)  Peripheral clock 5 to the IOCONFIG block for prg. glitch filter Register */
  __IO uint32_t IOCONFIGCLKDIV4;        /*!< Offset: 0x13C (R/W)  Peripheral clock 4 to the IOCONFIG block for prg. glitch filter Register */
  __IO uint32_t IOCONFIGCLKDIV3;        /*!< Offset: 0x140 (R/W)  Peripheral clock 3 to the IOCONFIG block for prg. glitch filter Register */
  __IO uint32_t IOCONFIGCLKDIV2;        /*!< Offset: 0x144 (R/W)  Peripheral clock 2 to the IOCONFIG block for prg. glitch filter Register */
  __IO uint32_t IOCONFIGCLKDIV1;        /*!< Offset: 0x148 (R/W)  Peripheral clock 1 to the IOCONFIG block for prg. glitch filter Register */
  __IO uint32_t IOCONFIGCLKDIV0;	    /*!< Offset: 0x14C (R/W)  Peripheral clock 0 to the IOCONFIG block for prg. glitch filter Register */	  	            
  __IO uint32_t BODCTRL;                /*!< Offset: 0x150 (R/W)  BOD control Register */
  __IO uint32_t SYSTCKCAL;              /*!< Offset: 0x154 (R/W)  System tick counter calibration Register */
  __IO uint32_t AHBPRIO;                /*!< Offset: 0x158 (R/W)  AHB priority setting Register */
       uint32_t RESERVED14[5];
  __IO uint32_t IRQLATENCY;             /*!< Offset: 0x170 (R/W)  IQR delay Register */
  __IO uint32_t INTNMI;                 /*!< Offset: 0x174 (R/W)  NMI interrupt source configuration Control Register */
       uint32_t RESERVED16[34];          

  __IO uint32_t STARTAPRP0;             /*!< Offset: 0x200 (R/W)  Start logic edge control Register 0 */     
  __IO uint32_t STARTERP0;              /*!< Offset: 0x204 (R/W)  Start logic signal enable Register 0 */
  __O  uint32_t STARTRSRP0CLR;          /*!< Offset: 0x208 ( /W)  Start logic reset Register 0 */
  __I  uint32_t STARTSRP0;              /*!< Offset: 0x20C (R/ )  Start logic status Register 0 */
  __IO uint32_t STARTAPRP1;             /*!< Offset: 0x210 (R/W)  Start logic edge control Register 1 */  
  __IO uint32_t STARTERP1;              /*!< Offset: 0x214 (R/W)  Start logic signal enable Register 1 */   
  __O  uint32_t STARTRSRP1CLR;          /*!< Offset: 0x218 ( /W)  Start logic reset Register 1 */
  __I  uint32_t STARTSRP1;              /*!< Offset: 0x21C (R/ )  Start logic status Register 1 */
       uint32_t RESERVED17[4];

  __IO uint32_t PDSLEEPCFG;             /*!< Offset: 0x230 (R/W)  Power-down states in Deep-sleep mode Register  */
  __IO uint32_t PDAWAKECFG;             /*!< Offset: 0x234 (R/W)  Power-down states after wake-up from Deep-sleep mode Register*/       
  __IO uint32_t PDRUNCFG;               /*!< Offset: 0x238 (R/W)  Power-down configuration Register*/
       uint32_t RESERVED18[110];
  __I  uint32_t DEVICE_ID;              /*!< Offset: 0x3F4 (R/ )  Device ID Register */
} LPC_SYSCON_TypeDef;
/*@}*/ /* end of group LPC122x_SYSCON */


/*------------- Pin Connect Block (IOCON) --------------------------------*/
/** @addtogroup LPC122x_IOCON LPC122x I/O Configuration Block 
  @{
*/
typedef struct
{
  __IO uint32_t PIO2_28;		        /*!< Offset: 0x000 (R/W)  I/O Configuration Port2 Register 28 */
  __IO uint32_t PIO2_29;                /*!< Offset: 0x004 (R/W)  I/O Configuration Port2 Register 29 */
  __IO uint32_t PIO0_19;                /*!< Offset: 0x008 (R/W)  I/O Configuration Port0 Register 19 */
  __IO uint32_t PIO0_20;                /*!< Offset: 0x00C (R/W)  I/O Configuration Port0 Register 20 */
  __IO uint32_t PIO0_21;                /*!< Offset: 0x010 (R/W)  I/O Configuration Port0 Register 21 */
  __IO uint32_t PIO0_22;                /*!< Offset: 0x014 (R/W)  I/O Configuration Port0 Register 22 */
  __IO uint32_t PIO0_23;                /*!< Offset: 0x018 (R/W)  I/O Configuration Port0 Register 23 */
  __IO uint32_t PIO0_24;                /*!< Offset: 0x01C (R/W)  I/O Configuration Port0 Register 24 */

  __IO uint32_t PIO0_25;	            /*!< Offset: 0x020 (R/W)  I/O Configuration Port0 Register 25 */
  __IO uint32_t PIO0_26;                /*!< Offset: 0x024 (R/W)  I/O Configuration Port0 Register 26 */
  __IO uint32_t PIO0_27;                /*!< Offset: 0x028 (R/W)  I/O Configuration Port0 Register 27 */
  __IO uint32_t PIO2_12;                /*!< Offset: 0x02C (R/W)  I/O Configuration Port2 Register 12 */
  __IO uint32_t PIO2_13;                /*!< Offset: 0x030 (R/W)  I/O Configuration Port2 Register 13 */
  __IO uint32_t PIO2_14;                /*!< Offset: 0x034 (R/W)  I/O Configuration Port2 Register 14 */
  __IO uint32_t PIO2_15;                /*!< Offset: 0x038 (R/W)  I/O Configuration Port2 Register 15 */
  __IO uint32_t PIO0_28;                /*!< Offset: 0x03C (R/W)  I/O Configuration Port0 Register 28 */

  __IO uint32_t PIO0_29;		        /*!< Offset: 0x040 (R/W)  I/O Configuration Port0 Register 29 */
  __IO uint32_t PIO0_0;                 /*!< Offset: 0x044 (R/W)  I/O Configuration Port0 Register  0 */
  __IO uint32_t PIO0_1;                 /*!< Offset: 0x048 (R/W)  I/O Configuration Port0 Register  1 */
  __IO uint32_t PIO0_2;                 /*!< Offset: 0x04C (R/W)  I/O Configuration Port0 Register  2 */
       uint32_t RESERVED0[1];
  __IO uint32_t PIO0_3;                 /*!< Offset: 0x054 (R/W)  I/O Configuration Port0 Register  3 */
  __IO uint32_t PIO0_4;                 /*!< Offset: 0x058 (R/W)  I/O Configuration Port0 Register  4 */
  __IO uint32_t PIO0_5;                 /*!< Offset: 0x05C (R/W)  I/O Configuration Port0 Register  5 */

  __IO uint32_t PIO0_6;                 /*!< Offset: 0x060 (R/W)  I/O Configuration Port0 Register  6 */
  __IO uint32_t PIO0_7;                 /*!< Offset: 0x064 (R/W)  I/O Configuration Port0 Register  7 */
  __IO uint32_t PIO0_8;                 /*!< Offset: 0x068 (R/W)  I/O Configuration Port0 Register  8 */
  __IO uint32_t PIO0_9;                 /*!< Offset: 0x06C (R/W)  I/O Configuration Port0 Register  9 */
  __IO uint32_t PIO2_0;                 /*!< Offset: 0x070 (R/W)  I/O Configuration Port2 Register  0 */
  __IO uint32_t PIO2_1;                 /*!< Offset: 0x074 (R/W)  I/O Configuration Port2 Register  1 */
  __IO uint32_t PIO2_2;                 /*!< Offset: 0x078 (R/W)  I/O Configuration Port2 Register  2 */
  __IO uint32_t PIO2_3;                 /*!< Offset: 0x07C (R/W)  I/O Configuration Port2 Register  3 */

  __IO uint32_t PIO2_4;                 /*!< Offset: 0x080 (R/W)  I/O Configuration Port2 Register  4 */
  __IO uint32_t PIO2_5;                 /*!< Offset: 0x084 (R/W)  I/O Configuration Port2 Register  5 */
  __IO uint32_t PIO2_6;                 /*!< Offset: 0x088 (R/W)  I/O Configuration Port2 Register  6 */
  __IO uint32_t PIO2_7;                 /*!< Offset: 0x08C (R/W)  I/O Configuration Port2 Register  7 */
  __IO uint32_t PIO0_10;                /*!< Offset: 0x090 (R/W)  I/O Configuration Port0 Register 10 */
  __IO uint32_t PIO0_11;                /*!< Offset: 0x094 (R/W)  I/O Configuration Port0 Register 11 */
  __IO uint32_t PIO0_12;                /*!< Offset: 0x098 (R/W)  I/O Configuration Port0 Register 12 */
  __IO uint32_t PIO0_13;                /*!< Offset: 0x09C (R/W)  I/O Configuration Port0 Register 13 */

  __IO uint32_t PIO0_14;                /*!< Offset: 0x0A0 (R/W)  I/O Configuration Port0 Register 14 */
  __IO uint32_t PIO0_15;                /*!< Offset: 0x0A4 (R/W)  I/O Configuration Port0 Register 15 */
  __IO uint32_t PIO0_16;                /*!< Offset: 0x0A8 (R/W)  I/O Configuration Port0 Register 16 */
  __IO uint32_t PIO0_17;                /*!< Offset: 0x0AC (R/W)  I/O Configuration Port0 Register 17 */
  __IO uint32_t PIO0_18;                /*!< Offset: 0x0B0 (R/W)  I/O Configuration Port0 Register 18 */
  __IO uint32_t PIO0_30;                /*!< Offset: 0x0B4 (R/W)  I/O Configuration Port0 Register 30 */
  __IO uint32_t PIO0_31;                /*!< Offset: 0x0B8 (R/W)  I/O Configuration Port0 Register 31 */
  __IO uint32_t PIO1_0;                 /*!< Offset: 0x0BC (R/W)  I/O Configuration Port1 Register  0 */

  __IO uint32_t PIO1_1;                 /*!< Offset: 0x0C0 (R/W)  I/O Configuration Port1 Register  1 */
  __IO uint32_t PIO1_2;                 /*!< Offset: 0x0C4 (R/W)  I/O Configuration Port1 Register  2 */
  __IO uint32_t PIO1_3;                 /*!< Offset: 0x0C8 (R/W)  I/O Configuration Port1 Register  3 */
  __IO uint32_t PIO1_4;                 /*!< Offset: 0x0CC (R/W)  I/O Configuration Port1 Register  4 */
  __IO uint32_t PIO1_5;                 /*!< Offset: 0x0D0 (R/W)  I/O Configuration Port1 Register  5 */
  __IO uint32_t PIO1_6;                 /*!< Offset: 0x0D4 (R/W)  I/O Configuration Port1 Register  6 */
       uint32_t RESERVED1[2];

  __IO uint32_t PIO2_8;                 /*!< Offset: 0x0E0 (R/W)  I/O Configuration Port2 Register  8 */
  __IO uint32_t PIO2_9;                 /*!< Offset: 0x0E$ (R/W)  I/O Configuration Port2 Register  9 */
  __IO uint32_t PIO2_10;                /*!< Offset: 0x0E8 (R/W)  I/O Configuration Port2 Register 10 */
  __IO uint32_t PIO2_11;                /*!< Offset: 0x0EC (R/W)  I/O Configuration Port2 Register 12 */
} LPC_IOCON_TypeDef;
