MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC1225FBD64-321/mcu.h
/*@}*/ /* end of group LPC122x_IOCON */


/*------------- microDMA (DMA) --------------------------*/
/** @addtogroup LPC122x_DMA LPC122x microDMA
  @{
*/
typedef struct
{
  __I  uint32_t STATUS;                 /*!< Offset: 0x000 (R/ )  DMA status register Register */
  __O  uint32_t CFG;                    /*!< Offset: 0x004 ( /W)  DMA configuration Register */
  __IO uint32_t CTRL_BASE_PTR;          /*!< Offset: 0x008 (R/W)  Channel control base pointer Register */
  __I  uint32_t ALT_CTRL_BASE_PTR;      /*!< Offset: 0x00C (R/ )  Channel alternate control base pointer Register */
  __I  uint32_t WAITONREQ_STATUS;       /*!< Offset: 0x010 (R/ )  Channel wait on request status Register */
  __O  uint32_t CHNL_SW_REQUEST;        /*!< Offset: 0x014 ( /W)  Channel software request Register */
  __IO uint32_t CHNL_USEBURST_SET;      /*!< Offset: 0x018 (R/W)  Channel useburst set Register */
  __O  uint32_t CHNL_USEBURST_CLR;      /*!< Offset: 0x01C ( /W)  Channel useburst clear Register */
  __IO uint32_t CHNL_REQ_MASK_SET;      /*!< Offset: 0x020 (R/W)  Channel request mask set Register */
  __O  uint32_t CHNL_REQ_MASK_CLR;      /*!< Offset: 0x024 ( /W)  Channel request mask clear Register */
  __IO uint32_t CHNL_ENABLE_SET;        /*!< Offset: 0x028 (R/W)  Channel enable set Register */
  __O  uint32_t CHNL_ENABLE_CLR;        /*!< Offset: 0x02C ( /W)  Channel enable clear Register */
  __IO uint32_t CHNL_PRI_ALT_SET;       /*!< Offset: 0x030 (R/W)  Channel primary-alternate set Register */
  __O  uint32_t CHNL_PRI_ALT_CLR;       /*!< Offset: 0x034 ( /W)  Channel primary-alternate clear Register */
  __IO uint32_t CHNL_PRIORITY_SET;      /*!< Offset: 0x038 (R/W)  Channel priority set Register */
  __O  uint32_t CHNL_PRIORITY_CLR;      /*!< Offset: 0x03C ( /W)  Channel priority clear Register */
	   uint32_t RESERVE0[3];
  __IO uint32_t ERR_CLR;				/*!< Offset: 0x04C (R/W)  Bus error clear Register */
  	   uint32_t RESERVE1[12];
  __IO uint32_t CHNL_IRQ_STATUS;		/*!< Offset: 0x080 (R/W)  Channel DMA interrupt status Register */
  __IO uint32_t IRQ_ERR_ENABLE;         /*!< Offset: 0x084 (R/W)  DMA error interrupt enable Register */
  __IO uint32_t CHNL_IRQ_ENABLE;        /*!< Offset: 0x088 (R/W)  Channel DMA interrupt enable Register */
} LPC_DMA_TypeDef;
/*@}*/ /* end of group LPC122x_DMA */


/*------------- Comparator (CMP) --------------------------------*/
/** @addtogroup LPC122x_CMP LPC122x Comparator
  @{
*/
typedef struct
{
  __IO uint32_t CMP;                    /*!< Offset: 0x000 (R/W)  Comparator control Register */
  __IO uint32_t VLAD;                   /*!< Offset: 0x004 (R/W)  Voltage ladder Register */
} LPC_COMP_TypeDef;
/*@}*/ /* end of group LPC122x_CMP */


/*------------- Real Timer Clock (RTC) --------------------------*/
/** @addtogroup LPC122x_RTC LPC122x Real-time Clock
  @{
*/
typedef struct
{
  __I  uint32_t DR;                     /*!< Offset: 0x000 (R/ )  Data Register */
  __IO uint32_t MR;                     /*!< Offset: 0x004 (R/W)  Match Register */
  __IO uint32_t LR;                     /*!< Offset: 0x008 (R/W)  Load Register */
  __IO uint32_t CR;                     /*!< Offset: 0x00C (R/W)  Control Register */
  __IO uint32_t IMSC;                   /*!< Offset: 0x010 (R/W)  Interrupt mask set/clear Register */
  __I  uint32_t IRS;                    /*!< Offset: 0x014 (R/ )  Raw interrupt status Register */
  __I  uint32_t MIS;                    /*!< Offset: 0x018 (R/ )  Masked interrupt status Register */
  __O  uint32_t ICR;                    /*!< Offset: 0x01C ( /W)  Interrupt clear Register */
} LPC_RTC_TypeDef;
/*@}*/ /* end of group LPC122x_RTC */


/*------------- Power Management Unit (PMU) --------------------------*/
/** @addtogroup LPC122x_PMU LPC122x Power Management Unit
  @{
*/
typedef struct
{
  __IO uint32_t PCON;                   /*!< Offset: 0x000 (R/W)  Power control Register */
  __IO uint32_t GPREG0;                 /*!< Offset: 0x004 (R/W)  General purpose Register 0 */
  __IO uint32_t GPREG1;                 /*!< Offset: 0x008 (R/W)  General purpose Register 1 */
  __IO uint32_t GPREG2;                 /*!< Offset: 0x00C (R/W)  General purpose Register 2 */
  __IO uint32_t GPREG3;                 /*!< Offset: 0x010 (R/W)  General purpose Register 3 */
  __IO uint32_t GPREG4;                 /*!< Offset: 0x014 (R/W)  General purpose Register 4 */
} LPC_PMU_TypeDef;
/*@}*/ /* end of group LPC122x_PMU */


/*------------- General Purpose Input/Output (GPIO) --------------------------*/
/** @addtogroup LPC122x_GPIO LPC122x General Purpose Input/Output 
  @{
*/
typedef struct
{
  __IO uint32_t MASK;                   /*!< Offset: 0x000 (R/W)  Pin value mask Register */
  __I  uint32_t PIN;                    /*!< Offset: 0x004 (R/ )  Pin value Register */
  __IO uint32_t OUT;                    /*!< Offset: 0x008 (R/W)  Pin output value Register */
  __O  uint32_t SET;                    /*!< Offset: 0x00C ( /W)  Pin output value set Register */
  __O  uint32_t CLR;                    /*!< Offset: 0x010 ( /W)  Pin output value clear Register */
  __O  uint32_t NOT;                    /*!< Offset: 0x014 ( /W)  Pin output value invert Register */
  	   uint32_t RESERVE[2];
  __IO uint32_t DIR;                    /*!< Offset: 0x020 (R/W)  Data direction Register */
  __IO uint32_t IS;                     /*!< Offset: 0x024 (R/W)  Interrupt sense Register */
  __IO uint32_t IBE;                    /*!< Offset: 0x028 (R/W)  Interrupt both edges Register */
  __IO uint32_t IEV;                    /*!< Offset: 0x02C (R/W)  Interrupt event Register */
  __IO uint32_t IE;                     /*!< Offset: 0x030 (R/W)  Interrupt mask Register */
  __I  uint32_t RIS;                    /*!< Offset: 0x034 (R/ )  Raw interrupt status Register */
  __I  uint32_t MIS;                    /*!< Offset: 0x038 (R/ )  Masked interrupt status Register */
  __O  uint32_t IC;                     /*!< Offset: 0x03C ( /W)  Interrupt clear Register */
} LPC_GPIO_TypeDef;
/*@}*/ /* end of group LPC122x_GPIO */


/*------------- Timer (TMR) --------------------------------------------------*/
/** @addtogroup LPC122x_TMR LPC122x 16/32-bit Counter/Timer 
  @{
*/
typedef struct
{
  __IO uint32_t IR;                     /*!< Offset: 0x000 (R/W)  Interrupt Register */
  __IO uint32_t TCR;                    /*!< Offset: 0x004 (R/W)  Timer Control Register */
  __IO uint32_t TC;                     /*!< Offset: 0x008 (R/W)  Timer Counter Register */
  __IO uint32_t PR;                     /*!< Offset: 0x00C (R/W)  Prescale Register */
  __IO uint32_t PC;                     /*!< Offset: 0x010 (R/W)  Prescale Counter Register */
  __IO uint32_t MCR;                    /*!< Offset: 0x014 (R/W)  Match Control Register */
  __IO uint32_t MR0;                    /*!< Offset: 0x018 (R/W)  Match Register 0 */
  __IO uint32_t MR1;                    /*!< Offset: 0x01C (R/W)  Match Register 1 */
  __IO uint32_t MR2;                    /*!< Offset: 0x020 (R/W)  Match Register 2 */
  __IO uint32_t MR3;                    /*!< Offset: 0x024 (R/W)  Match Register 3 */
  __IO uint32_t CCR;                    /*!< Offset: 0x028 (R/W)  Capture Control Register */
  __I  uint32_t CR0;                    /*!< Offset: 0x02C (R/ )  Capture Register 0 */
  __I  uint32_t CR1;                    /*!< Offset: 0x030 (R/ )  Capture Register 1 */
  __I  uint32_t CR2;                    /*!< Offset: 0x034 (R/ )  Capture Register 2 */
  __I  uint32_t CR3;                    /*!< Offset: 0x038 (R/ )  Capture Register 3 */
  __IO uint32_t EMR;                    /*!< Offset: 0x03C (R/W)  External Match Register */
       uint32_t RESERVED2[12];
  __IO uint32_t CTCR;                   /*!< Offset: 0x070 (R/W)  Count Control Register */
  __IO uint32_t PWMC;                   /*!< Offset: 0x074 (R/W)  PWM Control Register */
} LPC_TMR_TypeDef;
/*@}*/ /* end of group LPC122x_TMR */


/*------------- Universal Asynchronous Receiver Transmitter (UART) -----------*/
/** @addtogroup LPC122x_UART LPC122x Universal Asynchronous Receiver/Transmitter 
  @{
*/
typedef struct
{
  union {
  __I  uint32_t  RBR;                   /*!< Offset: 0x000 (R/ )  Receiver Buffer  Register */
  __O  uint32_t  THR;                   /*!< Offset: 0x000 ( /W)  Transmit Holding Register */
  __IO uint32_t  DLL;                   /*!< Offset: 0x000 (R/W)  Divisor Latch LSB */
  };
  union {
  __IO uint32_t  DLM;                   /*!< Offset: 0x004 (R/W)  Divisor Latch MSB */
  __IO uint32_t  IER;                   /*!< Offset: 0x000 (R/W)  Interrupt Enable Register */
  };
  union {
  __I  uint32_t  IIR;                   /*!< Offset: 0x008 (R/ )  Interrupt ID Register */
  __O  uint32_t  FCR;                   /*!< Offset: 0x008 ( /W)  FIFO Control Register */
  };
  __IO uint32_t  LCR;                   /*!< Offset: 0x00C (R/W)  Line Control Register */
  __IO uint32_t  MCR;                   /*!< Offset: 0x010 (R/W)  Modem control Register */
  __I  uint32_t  LSR;                   /*!< Offset: 0x014 (R/ )  Line Status Register */
  __I  uint32_t  MSR;                   /*!< Offset: 0x018 (R/ )  Modem status Register */
  __IO uint32_t  SCR;                   /*!< Offset: 0x01C (R/W)  Scratch Pad Register */
  __IO uint32_t  ACR;                   /*!< Offset: 0x020 (R/W)  Auto-baud Control Register */
  __IO uint8_t  ICR;                    /*!< Offset: 0x024 (R/W)  IrDA Control Register */
  __IO uint32_t  FDR;                   /*!< Offset: 0x028 (R/W)  Fractional Divider Register */
       uint32_t  RESERVED1;
  __IO uint32_t  TER;                   /*!< Offset: 0x030 (R/W)  Transmit Enable Register */
       uint32_t  RESERVED2[6];
  __IO uint32_t  RS485CTRL;             /*!< Offset: 0x04C (R/W)  RS-485/EIA-485 Control Register */
  __IO uint32_t  ADRMATCH;              /*!< Offset: 0x050 (R/W)  RS-485/EIA-485 address match Register */
  __IO uint32_t  RS485DLY;              /*!< Offset: 0x054 (R/W)  RS-485/EIA-485 direction control delay Register */
  __I  uint32_t  FIFOLVL;               /*!< Offset: 0x058 (R/ )  FIFO Level Register */
} LPC_UART_TypeDef;
/*@}*/ /* end of group LPC122x_UART */


/*------------- Synchronous Serial Communication (SSP) -----------------------*/
/** @addtogroup LPC122x_SSP LPC122x Synchronous Serial Port 
  @{
*/
typedef struct
{
  __IO uint32_t CR0;                    /*!< Offset: 0x000 (R/W)  Control Register 0 */
  __IO uint32_t CR1;                    /*!< Offset: 0x004 (R/W)  Control Register 1 */
  __IO uint32_t DR;                     /*!< Offset: 0x008 (R/W)  Data Register */
  __I  uint32_t SR;                     /*!< Offset: 0x00C (R/ )  Status Register */
  __IO uint32_t CPSR;                   /*!< Offset: 0x010 (R/W)  Clock Prescale Register */
  __IO uint32_t IMSC;                   /*!< Offset: 0x014 (R/W)  Interrupt Mask Set and Clear Register */
  __I  uint32_t RIS;                    /*!< Offset: 0x018 (R/ )  Raw Interrupt Status Register */
  __I  uint32_t MIS;                    /*!< Offset: 0x01C (R/ )  Masked Interrupt Status Register */
  __O  uint32_t ICR;                    /*!< Offset: 0x020 ( /W)  SSPICR Interrupt Clear Register */
  __IO uint32_t DMACR;                  /*!< Offset: 0x024 (R/W)  DMA Control Register */
} LPC_SSP_TypeDef;
/*@}*/ /* end of group LPC122x_SSP */


/*------------- Inter-Integrated Circuit (I2C) -------------------------------*/
/** @addtogroup LPC122x_I2C LPC122x I2C-Bus Interface 
  @{
*/
typedef struct
{
  __IO uint32_t CONSET;                 /*!< Offset: 0x000 (R/W)  I2C Control Set Register */
  __I  uint32_t STAT;                   /*!< Offset: 0x004 (R/ )  I2C Status Register */
  __IO uint32_t DAT;                    /*!< Offset: 0x008 (R/W)  I2C Data Register */
  __IO uint32_t ADR0;                   /*!< Offset: 0x00C (R/W)  I2C Slave Address Register 0 */
  __IO uint32_t SCLH;                   /*!< Offset: 0x010 (R/W)  SCH Duty Cycle Register High Half Word */
  __IO uint32_t SCLL;                   /*!< Offset: 0x014 (R/W)  SCL Duty Cycle Register Low Half Word */
  __O  uint32_t CONCLR;                 /*!< Offset: 0x018 ( /W)  I2C Control Clear Register */
  __IO uint32_t MMCTRL;                 /*!< Offset: 0x01C (R/W)  Monitor mode control register */
  __IO uint32_t ADR1;                   /*!< Offset: 0x020 (R/W)  I2C Slave Address Register 1 */
  __IO uint32_t ADR2;                   /*!< Offset: 0x024 (R/W)  I2C Slave Address Register 2 */
  __IO uint32_t ADR3;                   /*!< Offset: 0x028 (R/W)  I2C Slave Address Register 3 */
  __I  uint32_t DATA_BUFFER;            /*!< Offset: 0x02C (R/ )  Data buffer Register */
  __IO uint32_t MASK0;                  /*!< Offset: 0x030 (R/W)  I2C Slave address mask register 0 */
  __IO uint32_t MASK1;                  /*!< Offset: 0x034 (R/W)  I2C Slave address mask register 1 */
  __IO uint32_t MASK2;                  /*!< Offset: 0x038 (R/W)  I2C Slave address mask register 2 */
  __IO uint32_t MASK3;                  /*!< Offset: 0x03C (R/W)  I2C Slave address mask register 3 */
} LPC_I2C_TypeDef;
/*@}*/ /* end of group LPC122x_I2C */


/*------------- Watchdog Timer (WWDT) -----------------------------------------*/
/** @addtogroup LPC122x_WDT LPC122x Windowed WatchDog Timer 
  @{
*/
typedef struct
{
  __IO uint32_t MOD;                    /*!< Offset: 0x000 (R/W)  Watchdog mode Register */
  __IO uint32_t TC;                     /*!< Offset: 0x004 (R/W)  Watchdog timer constant Register */
  __O  uint32_t FEED;                   /*!< Offset: 0x008 ( /W)  Watchdog feed sequence Register */
  __I  uint32_t TV;                     /*!< Offset: 0x00C (R/ )  Watchdog timer value Register */
  __IO uint32_t CLKSEL;                 /*!< Offset: 0x010 (R/W)  Watchdog clock source selection Register */
  __IO uint32_t WARNINT;                /*!< Offset: 0x014 (R/W)  Watchdog Warning Interrupt compare value Register */
  __IO uint32_t WINDOW;                 /*!< Offset: 0x018 (R/W)  Watchdog Window compare value Register */

} LPC_WDT_TypeDef;
